[
  {
    "role": "President",
    "description": "The role of president involves guiding the club in the correct direction in order to reach club goals, aiding the team to execute needed duties, writing club reports. They are responsible for acting as the aliason to CSCE national and regional and recruiting the executive team, associates and consultants.",
    "eventKey": "0"
  },
  {
    "role": "VP Finance",
    "description": "Submit funding applications and documents in accordance with the appropriate deadlines. Manages, tracks, and balances the chapter budget throughout the school year through tabulating revenue and expenses as accrued. Works alongside the VP External to create sponsorship packages and incentives with engineering companies.",
    "eventKey": "1"
  },
  {
    "role": "VP Logistics",
    "description": "Organizes logistics for events and chapter initiatives (e.g. room bookings, catering, audio/visual equipment). Ensures that chapter events are planned in a timely manner. Manages club assets and rentals (lockers, temporary office spaces, club merchandise). Supports President with event planning and other operational tasks.",
    "eventKey": "2"
  },
  {
    "role": "VP Academia",
    "description": "Manages an undergraduate research opportunity program with civil engineering professors. Increase familiarity and visibility of graduate studies and research to civil engineering at the University of Toronto. Organize an undergraduate and graduate research showcase.",
    "eventKey": "3"
  },
  {
    "role": "Academics/Logistics Associate",
    "description": "Supports VP Logistics. Supports VP Professional Development. Engage first-year civil engineering students with CSCE and professional development.",
    "eventKey": "4"
  },
  {
    "role": "VP Professional Development",
    "description": "Manage a mentorship program with current undergraduate students with civil engineering alumni. Works alongside the VP External to create events that best serve students’ professional development needs and outreach to civil engineering alumni. Works alongside President to organize a plan for the school year to reach certain milestones for each facet of civil engineering.",
    "eventKey": "5"
  },
  {
    "role": "Mentorship Associate",
    "description": "Support the VP Professional Development with organizing the mentorship program with current undergraduate students with civil engineering alumni.",
    "eventKey": "6"
  },
  {
    "role": "VP Marketing",
    "description": "Oversees all marketing operations of the chapter (eg. Event Promotion, Facebook, Instagram). Ensures all marketing materials and events (posters, online banners, class announcements, alerts, etc.) are released in a timely manner. Develops and implements a marketing strategy to increase communication and involvement between CSCE and the student body. Manage and maintain a new chapter website including current and archived events, chapter sponsors, etc.",
    "eventKey": "7"
  },
  {
    "role": "Marketing Associate",
    "description": "Support the VP Marketing by helping with the development of marketing materials (Instagram posts, Facebook event pages, Posters).",
    "eventKey": "8"
  },
  {
    "role": "VP Community",
    "description": "Organizes civil-based charity and goodwill events. Generates year-long student initiatives to increase community engagement. Brainstorms and implements fundraising events and opportunities.",
    "eventKey": "9"
  },
  {
    "role": "Community Associate",
    "description": "Support the VP Community by organizing civil-based charity and goodwill events to generate year-long student initiatives to increase community engagement. Engage first-year civil engineering students with CSCE and professional development.",
    "eventKey": "10"
  },
  {
    "role": "PEY Consultant",
    "description": "To be added soon.",
    "eventKey": "11"
  }
]
